_posts/2014-08-19-Storing-solutions-to-homework-problems-in-an-org-file-with-encrypted-headlines.html
---
title: Storing solutions to homework problems in an org-file with encrypted headlines
date: 2014/08/19 09:30:27
updated: 2014/08/19 09:30:27
categories: orgmode
tags: 
---


<p>
I have been creating homework problems in org-files, which I distribute to students. A recurring dilemma I have had is where do you put the solution? If you put it in a separate file, there is not an elegant way to keep them connected, so if you end up changing the problem, it is easy to forget to update the solution.
</p>

<p>
Recently I learned about org-crypt. This allows you to encrypt the content of a heading. All you have to do is tag a heading with :crypt:, and when you save the file it will encrypt the contents of the heading. In this example, we try that out. We will use symmetric encryption, which just uses a password. Here is the setup for your init.el file.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">require</span> '<span style="color: #cd0000;">org-crypt</span>)
(org-crypt-use-before-save-magic)
(setq org-tags-exclude-from-inheritance (quote (<span style="color: #228b22;">"crypt"</span>)))
;;  <span style="color: #ff0000; font-weight: bold;">set to nil to use symmetric encryption.</span>
(setq org-crypt-key nil)
</pre>
</div>

<p>
Now, for the question. What is the Answer to the Ultimate Question of Life, The Universe, and Everything? 
</p>


<p>
The solution is encrypted below. Note, all you have to do is tag the headline with crypt, and when you save the file, you will be prompted for a passphrase and to confirm the passphrase (I used the passphrase 1234). To decrypt the solution, run <a href="org-decrypt-entries">org-decrypt-entries</a>. You may get a warning that autosave can cause leakage, and a request to disable it for this buffer. You can do that. Then, You will be prompted for a passphrase for symmetric encryption. Enter 1234, and you should be rewarded with the solution!
</p>

<p>
This could be a good way to keep solutions and problems together, as long as you can remember the passphrase! The passphrase would obviously have to be different for each problem (or one passphrase would open all solutions), and unguessable for this to be useful. Once again, Emacs can help you out. We just need to remember one secret passphrase, and then compute a cryptographic hash that we could use for the encrypting passphrase. We could then just concatenate our secret key onto some unchanging property of the problem that will not change, and generate a secret password. Like this for example.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">let</span> ((my-secret-key <span style="color: #228b22;">"1234"</span>))
  (format <span style="color: #228b22;">"This problem passphrase is %s."</span> (secure-hash 'md5 (concat my-secret-key (org-get-heading t t)))))
</pre>
</div>

<pre class="example">
This problem passphrase is 68ea5a0eefc31d34ee5d562891e4dcb7.
</pre>

<p>
For this to work, you must keep your secret key absolutely secret, or someone could generate the passwords for each assignment. Also, you must make sure the property of the problem you use never changes, or you will not be able to generate a usable passphrase again! The property could be a filename, or problem label. All that really matters is that it not change, since the solution is stored in encrypted form. It might make sense to write the problem passphrase to a file, as long as the file is not accessible to students, and it is somehow always kept up to date.
</p>

<p>
Some other notes:
</p>
<ol class="org-ol">
<li>org-mode seems to save the passphrase somewhere, so when you save the file after decrypting it, the headline is automatically reencrypted with the same password.
</li>
<li>If you remove the crypt tag, the file is saved in plain text
</li>
<li>This seems to rely on GnuPG being installed on your computer.
</li>
</ol>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Solution&#xa0;&#xa0;&#xa0;<span class="tag"><span class="crypt">crypt</span></span></h2>
<div class="outline-text-2" id="text-1">
<p>
&#x2013;&#x2014;BEGIN PGP MESSAGE&#x2013;&#x2014;
Version: GnuPG v1
</p>

<p>
jA0EAwMC+AOmtRnbOY1gyZddPkzbHlSfApI4u29D3n05rwScSnx2jlmT8dPP6xES
DWGfnByJhtHC/IhbmmECPH4F88lT8RsY8Ng6RmZjGsUJDXZzLBv3CITAgwx4sXz0
hq0dv4HvlW4OUNBoM6HzflMhJO/YlYHf00H94nzZ9T++mW+foHLMSiJ3XdglWMIA
EwIz2uBmwEnsOLQ4M5W3lTBmet9iVKsT
=Zo7c
&#x2013;&#x2014;END PGP MESSAGE&#x2013;&#x2014;
</p>
</div>
</div>
<p>Copyright (C) 2014 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2014/08/19/Storing-solutions-to-homework-problems-in-an-org-file-with-encrypted-headlines.org">org-mode source</a><p><p>Org-mode version = 8.2.7c</p>